moesay/qemu_TivaC/hw/misc/tm4c123_sysctl.c
    switch(addr) {
        case SYSCTL_DID0:
            return s->sysctl_did0;
        case SYSCTL_DID1:
            return s->sysctl_did1;
        case SYSCTL_PBORCTL:
            return s->sysctl_pborctl;
        case SYSCTL_RIS:
            return s->sysctl_ris;
        case SYSCTL_IMC:
            return s->sysctl_imc;
        case SYSCTL_MISC:
            return s->sysctl_misc;
        case SYSCTL_RESC:
            return s->sysctl_resc;
        case SYSCTL_RCC:
            return s->sysctl_rcc;
        case SYSCTL_GPIOHBCTL:
            return s->sysctl_gpiohbctl;
        case SYSCTL_RCC2:
            return s->sysctl_rcc2;
        case SYSCTL_MOSCCTL:
            return s->sysctl_moscctl;
        case SYSCTL_DSLPCLKCFG:
            return s->sysctl_dslpclkcfg;
        case SYSCTL_SYSPROP:
            return s->sysctl_sysprop;
        case SYSCTL_PIOSCCAL:
            return s->sysctl_piosccal;
        case SYSCTL_PIOSCSTAT:
            return s->sysctl_pioscstat;
        case SYSCTL_PLLFREQ0:
            return s->sysctl_pllfreq0;
        case SYSCTL_PLLFREQ1:
            return s->sysctl_pllfreq1;
        case SYSCTL_PLLSTAT:
            return s->sysctl_pllstat;
        case SYSCTL_SLPPWRCFG:
            return s->sysctl_slppwrcfg;
        case SYSCTL_DSLPPWRCFG:
            return s->sysctl_dslppwrcfg;
        case SYSCTL_LDOSPCTL:
            return s->sysctl_ldospctl;
        case SYSCTL_LDOSPCAL:
            return s->sysctl_ldospcal;
        case SYSCTL_LDODPCTL:
            return s->sysctl_ldodpctl;
        case SYSCTL_LDODPCAL:
            return s->sysctl_ldodpcal;
        case SYSCTL_SDPMST:
            return s->sysctl_sdpmst;
        case SYSCTL_PPWD:
            return s->sysctl_ppwd;
        case SYSCTL_PPTIMER:
            return s->sysctl_pptimer;
        case SYSCTL_PPGPIO:
            return s->sysctl_ppgpio;
        case SYSCTL_PPDMA:
            return s->sysctl_ppdma;
        case SYSCTL_PPHIB:
            return s->sysctl_pphib;
        case SYSCTL_PPUART:
            return s->sysctl_ppuart;
        case SYSCTL_PPSI:
            return s->sysctl_ppsi;
        case SYSCTL_PPI2C:
            return s->sysctl_ppi2c;
        case SYSCTL_PPUSB:
            return s->sysctl_ppusb;
        case SYSCTL_PPCAN:
            return s->sysctl_ppcan;
        case SYSCTL_PPADC:
            return s->sysctl_ppadc;
        case SYSCTL_PPACMP:
            return s->sysctl_ppacmp;
        case SYSCTL_PPPWM:
            return s->sysctl_pppwm;
        case SYSCTL_PPQEI:
            return s->sysctl_ppqei;
        case SYSCTL_PPEEPROM:
            return s->sysctl_ppeeprom;
        case SYSCTL_PPWTIMER:
            return s->sysctl_ppwtimer;
        case SYSCTL_SRWD:
            return s->sysctl_srwd;
        case SYSCTL_SRTIMER:
            return s->sysctl_srtimer;
        case SYSCTL_SRGPIO:
            return s->sysctl_srgpio;
        case SYSCTL_SRDMA:
            return s->sysctl_srdma;
        case SYSCTL_SRHIB:
            return s->sysctl_srhib;
        case SYSCTL_SRUART:
            return s->sysctl_sruart;
        case SYSCTL_SRSSI:
            return s->sysctl_srssi;
        case SYSCTL_SRI2C:
            return s->sysctl_sri2c;
        case SYSCTL_SRUSB:
            return s->sysctl_srusb;
        case SYSCTL_SRCAN:
            return s->sysctl_srcan;
        case SYSCTL_SRADC:
            return s->sysctl_sradc;
        case SYSCTL_SRACMP:
            return s->sysctl_sracmp;
        case SYSCTL_SRPWM:
            return s->sysctl_srpwm;
        case SYSCTL_SRQEI:
            return s->sysctl_srqei;
        case SYSCTL_SREEPROM:
            return s->sysctl_sreeprom;
        case SYSCTL_SRWTIMER:
            return s->sysctl_srwtimer;
        case SYSCTL_RCGCWD:
            return s->sysctl_rcgcwd;
        case SYSCTL_RCGCTIMER:
            return s->sysctl_rcgctimer;
        case SYSCTL_RCGCGPIO:
            return s->sysctl_rcgcgpio;
        case SYSCTL_RCGCDMA:
            return s->sysctl_rcgcdma;
        case SYSCTL_RCGCHIB:
            return s->sysctl_rcgchib;
        case SYSCTL_RCGCUART:
            return s->sysctl_rcgcuart;
        case SYSCTL_RCGCSSI:
            return s->sysctl_rcgcssi;
        case SYSCTL_RCGCI2C:
            return s->sysctl_rcgci2c;
        case SYSCTL_RCGCUSB:
            return s->sysctl_rcgcusb;
        case SYSCTL_RCGCCAN:
            return s->sysctl_rcgccan;
        case SYSCTL_RCGCADC:
            return s->sysctl_rcgcadc;
        case SYSCTL_RCGCACMP:
            return s->sysctl_rcgcacmp;
        case SYSCTL_RCGCPWM:
            return s->sysctl_rcgcpwm;
        case SYSCTL_RCGCQEI:
            return s->sysctl_rcgcqei;
        case SYSCTL_RCGCEEPROM:
            return s->sysctl_rcgceeprom;
        case SYSCTL_RCGCWTIMER:
            return s->sysctl_rcgcwtimer;
        case SYSCTL_SCGCWD:
            return s->sysctl_scgcwd;
        case SYSCTL_SCGCTIMER:
            return s->sysctl_scgctimer;
        case SYSCTL_SCGCGPIO:
            return s->sysctl_scgcgpio;
        case SYSCTL_SCGCDMA:
            return s->sysctl_scgcdma;
        case SYSCTL_SCGCHIB:
            return s->sysctl_scgchib;
        case SYSCTL_SCGCUART:
            return s->sysctl_scgcuart;
        case SYSCTL_SCGCSSI:
            return s->sysctl_scgcssi;
        case SYSCTL_SCGCI2C:
            return s->sysctl_scgci2c;
        case SYSCTL_SCGCUSB:
            return s->sysctl_scgcusb;
        case SYSCTL_SCGCCAN:
            return s->sysctl_scgccan;
        case SYSCTL_SCGCADC:
            return s->sysctl_scgcadc;
        case SYSCTL_SCGCACMP:
            return s->sysctl_scgcacmp;
        case SYSCTL_SCGCPWM:
            return s->sysctl_scgcpwm;
        case SYSCTL_SCGCQEI:
            return s->sysctl_scgcqei;
        case SYSCTL_SCGCEEPROM:
            return s->sysctl_scgceeprom;
        case SYSCTL_SCGCWTIMER:
            return s->sysctl_scgcwtimer;
        case SYSCTL_DCGCWD:
            return s->sysctl_dcgcwd;
        case SYSCTL_DCGCTIMER:
            return s->sysctl_dcgctimer;
        case SYSCTL_DCGCGPIO:
            return s->sysctl_dcgcgpio;
        case SYSCTL_DCGCDMA:
            return s->sysctl_dcgcdma;
        case SYSCTL_DCGCHIB:
            return s->sysctl_dcgchib;
        case SYSCTL_DCGCUART:
            return s->sysctl_dcgcuart;
        case SYSCTL_DCGCSSI:
            return s->sysctl_dcgcssi;
        case SYSCTL_DCGCI2C:
            return s->sysctl_dcgci2c;
        case SYSCTL_DCGCUSB:
            return s->sysctl_dcgcusb;
        case SYSCTL_DCGCCAN:
            return s->sysctl_dcgccan;
        case SYSCTL_DCGCADC:
            return s->sysctl_dcgcadc;
        case SYSCTL_DCGCACMP:
            return s->sysctl_dcgcacmp;
        case SYSCTL_DCGCPWM:
            return s->sysctl_dcgcpwm;
        case SYSCTL_DCGCQEI:
            return s->sysctl_dcgcqei;
        case SYSCTL_DCGCEEPROM:
            return s->sysctl_dcgceeprom;
        case SYSCTL_DCGCWTIME:
            return s->sysctl_dcgcwtime;
        case SYSCTL_PRWD:
            return s->sysctl_prwd;
        case SYSCTL_PRTIMER:
            return s->sysctl_prtimer;
        case SYSCTL_PRGPIO:
            return s->sysctl_prgpio;
        case SYSCTL_PRDMA:
            return s->sysctl_prdma;
        case SYSCTL_PRHIB:
            return s->sysctl_prhib;
        case SYSCTL_PRUART:
            return s->sysctl_pruart;
        case SYSCTL_PRSSI:
            return s->sysctl_prssi;
        case SYSCTL_PRI2C:
            return s->sysctl_pri2c;
        case SYSCTL_PRUSB:
            return s->sysctl_prusb;
        case SYSCTL_PRCAN:
            return s->sysctl_prcan;
        case SYSCTL_PRADC:
            return s->sysctl_pradc;
        case SYSCTL_PRACMP:
            return s->sysctl_pracmp;
        case SYSCTL_PRPWM:
            return s->sysctl_prpwm;
        case SYSCTL_PRQEI:
            return s->sysctl_prqei;
        case SYSCTL_PREEPROM:
            return s->sysctl_preeprom;
        case SYSCTL_PRWTIMER:
            return s->sysctl_prwtimer;
        default:
            LOG("Bad address 0x%"HWADDR_PRIx"\n", addr);
            break;
    }
    return 0;
}

static const MemoryRegionOps tm4c123_sysctl_ops = {
    .read = tm4c123_sysctl_read,
    .write = tm4c123_sysctl_write,
    .endianness = DEVICE_NATIVE_ENDIAN,
};

static void tm4c123_sysctl_init(Object *obj)
{
    TM4C123SysCtlState *s = TM4C123_SYSCTL(obj);

    s->mainclk = clock_new(OBJECT(s), "main-clk");
    clock_set_hz(s->mainclk, 1000*1000);
    s->outclk = qdev_init_clock_out(DEVICE(s), "outclk");
    clock_set_source(s->outclk, s->mainclk);

    memory_region_init_io(&s->mmio, obj, &tm4c123_sysctl_ops, s, TYPE_TM4C123_SYSCTL, 0xFFF);
    sysbus_init_mmio(SYS_BUS_DEVICE(obj), &s->mmio);
}

static void tm4c123_sysctl_realize(DeviceState *dev, Error **errp)
{
    TM4C123SysCtlState *s = TM4C123_SYSCTL(dev);
    tm4c123_sysctl_update_system_clock(s);

}

static void tm4c123_sysctl_class_init(ObjectClass *kclass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(kclass);
    dc->reset = tm4c123_sysctl_reset;
    dc->realize = tm4c123_sysctl_realize;
}

static const TypeInfo tm4c123_sysctl_info = {
    .name = TYPE_TM4C123_SYSCTL,
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(TM4C123SysCtlState),
    .instance_init = tm4c123_sysctl_init,
    .class_init = tm4c123_sysctl_class_init,
};

static void tm4c123_sysctl_register_types(void)
{
    type_register_static(&tm4c123_sysctl_info);
}

type_init(tm4c123_sysctl_register_types)
